app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "date", "picture", "subject", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", ""], ["created_at", Sat, 29 Mar 2014 00:11:19 UTC +00:00], ["date", Sat, 29 Mar 2014], ["picture", "Untitled.png"], ["subject", ""], ["updated_at", Sat, 29 Mar 2014 00:11:19 UTC +00:00]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "subject" = ?, "picture" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["subject", "せっかくなんで、何でもいいから、このサイトみたひと投稿してみてください！"], ["picture", "9df7c8a0.jpg"], ["updated_at", Sat, 29 Mar 2014 01:44:12 UTC +00:00]]